{
    "Email": "{ragrawa1@andrew.cmu.edu}",

    
    "Name": "{Neo4J}",
    
    
    "Description": "Neo4j is a highly scalable native graph database that leverages data relationships as first-class entities, helping enterprises build intelligent applications to meet today’s evolving data challenges. It provides ACID Transactions with online backups and high availability. DB Engines ranks Neo4j as the best graph processing database system.",
    "Description Citations": [
        "{https://neo4j.com/}"
    ],
    
    
    "History": "Neo4j's first version was released in February, 2010 by Neo Technology in San Francisco. It is an ongoing project with the latest stable release 3.0 in April 2016. The idea behind developing Neo4j as a graph processing software was to store your relationships as first-class entities unlike NoSQL aggregate databases.",
    "History Citations": [
        "{https://neo4j.com/blog/history-and-future-of-graph-data/"
    ],
    
    
    "System Architecture Options": [
        "Shared-Nothing"
    ],
    "System Architecture Description": "Neo4j offers a shared-nothing architecture with a single write master and multiple read replicas thus consumes significant instance based storage. ",
    "System Architecture Citations": [
        "{https://d0.awsstatic.com/whitepapers/Database/neo4j-graph-databases-aws.pdf}",
        "{https://aws.amazon.com/nosql/graph/}"
    ],
    
    
    "Query Interface Options": [
        "Custom API"
    ],
    "Query Interface Description": "Cypher is a declarative, SQL-inspired language for describing patterns in graphs visually using an ascii-art syntax. One of the most powerful ability of Cypher is the notion to use -> operator to define relationships which are important in Graph Databases.",
    "Query Interface Citations": [
        "{https://neo4j.com/developer/cypher-query-language/"
    ],
    
    
    "Data Model Options": [
        "Other"
    ],
    "Data Model Description": "Neo4j uses a Graph data model. The fundamental units which form a graph are nodes and relationships. This is stored with key-value style properties on both. Relationships connect two different nodes to each other, and are both typed and directed although we still have the flexibility to traverse the relationships in both the directions.",
    "Data Model Citations": [
        "{https://neo4j.com/developer/guide-data-modeling/}",
        "{https://neo4j.com/blog/modeling-categories-in-a-graph-database/}"
    ],
    
    
    "Storage Model Options": [
        "Custom"
    ],
    "Storage Model Description": "Each node and its properties are stored on the disk using a doubly linked list. Layout : byte  0 : 4 high bits of previous, 4 high bits of next pointers, bytes 1-4 : previous property record, bytes 5-8 : next property record, bytes 9-40 : payload ",
    "Storage Model Citations": [
        "{http://digitalstain.blogspot.com/2011/11/rooting-out-redundancy-new-neo4j.html}",
        "{https://neo4j.com/blog/neo4j-cassandra-transfer-data/}"
    ],
    
        
    "Storage Architecture Options": [
        "Disk-oriented"
    ],
    "Storage Architecture Description": "Neo4j has a disk-based, native storage manager optimised (optimisations typically revolve around using the cache effectively to avoid trips to the disk) for storing graph structures with maximum performance and scalability.",
    "Storage Architecture Citations": [
        "{https://neo4j.com/docs/ogm-manual/current/introduction/}"
    ],
    
    
    "Concurrency Control Options": [
        "Two-Phase Locking (Deadlock Detection)"
    ],
    "Concurrency Control Description": "Neo4j uses locks for transactions which may lead to deadlock. Deadlocks are detected and the transaction is marked for rollback. The transaction may be retried if needed by the user. The retry logic is left to the user.",
    "Concurrency Control Citations": [
        "{http://neo4j.com/docs/java-reference/current/#transactions-deadlocks}"
    ],
    
    
    "Isolation Levels Options": [
        "Read Committed",
        "Serializable"
    ],
    "Isolation Levels Description": "Neo4j supports ACID Transactions and the default isolation provided is READ_COMMITTED. The user can however acquire locks on nodes and relationships to achieve the SERIALIZABLE isolation. Deadlock Detection is inbuilt in the system.",
    "Isolation Levels Citations": [
        "{http://neo4j.com/docs/java-reference/current/#transactions}"
    ],
    
    
    "Indexes Options": [
        "Other"
    ],
    "Indexes Description": "Initially Neo4j did not support indexes however schema indexes were added in Neo4j 2.0, and now with Neo4j 2.3. Schema indexes allow to automatically index labelled nodes by one or more of their properties. Those indexes are then implicitly used by Cypher as secondary indexes and to infer the starting point(s) of a query",
    "Indexes Citations": [
        "{https://neo4j.com/news/labels-and-schema-indexes-in-neo4j/}",
        "{https://neo4j.com/blog/dark-side-neo4j-worst-practices/}"
    ],
    
    
    "Foreign Keys Options": [
        "Supported"
    ],
    "Foreign Keys Description": "The traditional notion of foreign keys in RDBMS is used in Neo4j as relationships.The simple abstraction of nodes and relationships in connected structures helps enable the concept of foreign keys in Neo4j. ",
    "Foreign Keys Citations": [
        "{https://neo4j.com/developer/graph-db-vs-rdbms/}",
        "{https://db-engines.com/en/system/Neo4j}"
    ],
    
    
    "Logging Options": [
        "Logical Logging"
    ],
    "Logging Description": "Logical transaction logs in Neo4j are used in scenarios when the database needs to be recovered after a unclean shutdown. They are also used for online backup operations, especially for incremental backups. These transaction log files are rotated after surpassing a certain size (25 Mb in size). The amount of log files or the used space can be configured.",
    "Logging Citations": [
        "{https://neo4j.com/developer/guide-performance-tuning/#_logical_logs}"
    ],
    
    
    "Checkpoints Options": [
        "Non-Blocking"
    ],
    "Checkpoints Description": "Neo4j can be backed up while it continues to serve user traffic (called “online” backup). Neo4j offers two backup options: full or incremental. These strategies can be combined to provide the best mix of safety and efficiency. Depending on the risk profile of the system, a typical strategy might be to have daily full backups and hourly incremental backups, or weekly full backups with daily incremental backups.",
    "Checkpoints Citations": [
        "{https://d0.awsstatic.com/whitepapers/Database/neo4j-graph-databases-aws.pdf}"
    ],
    
    
    "Views Options": [
        "Not Supported"
    ],
    "Views Description": "Neo4j does not support the concept of views like traditional RDMS. However, one can create a special VIEW Node. Querying a view now implies querying the created view node, traversing the edges to find the results.",
    "Views Citations": [
        "{https://books.google.com/books?id=SohgCgAAQBAJ&pg=PA102&lpg=PA102&dq=materialized+views+neo4j&source=bl&ots=sxD8olubei&sig=NVeDfEHtdgPZ8pJGjQTbVTAw30Q&hl=en&sa=X&ved=0ahUKEwiGz_yig-zTAhWEgCYKHSUwDSsQ6AEIWzAL#v=onepage&q=materialized%20views%20neo4j&f=false}"
    ],
    
    
    "Query Execution Options": [
        "Tuple-at-a-Time Model"
    ],
    "Query Execution": "Query Execution is done on a stream of tuples but compiled record types with the proper types and width. Vectorized / Morsels based approaches are planned for future releases.",
    "Query Execution Citations": [
        "{https://twitter.com/mesirii/status/863670543156957184}"
    ],
    
    
    "Stored Procedures Options": [
        "Supported"
    ],
    "Stored Procedures Description": "Stored procedures in Neo4j are called using Cypher calls. Arguments can be supplied directly within the query or taken from the associated parameter set. Procedures can be written in Java, compiled as jar files and put into the database as plugins.",
    "Stored Procedures Citations": [
        "{https://neo4j.com/docs/developer-manual/current/extending-neo4j/procedures/}"
    ],

    
    "Joins Options": [
        "Hash"
    ],
    "Joins Description": "NodeHashJoin API provided in the documentation joins the input coming from the left with the input coming from the right. The support for ValueHashJoins was also merged with the github Neo4j 3.0 repository.",
    "Joins Citations": [
        "{https://neo4j.com/docs/developer-manual/current/cypher/execution-plans/combining-operators/#query-plan-node-hash-join}",
        "{https://github.com/neo4j/neo4j/wiki/Neo4j-3.0-changelog}"
    ],
    
    
    "Query Compilation Options": [
    "Code Generation",
    "JIT Compilation"
    ],
    "Query Compilation Description": "Neo4j uses (byte) code generation in addition to JIT compilation. The JIT compilation is provided by the JVM.",
    "Query Compilation Citations": [
        "{https://twitter.com/mesirii/status/863670543156957184}"
    ],
    
    
    "Website": "{https://neo4j.com/}",
    
    
    "Programming Language": [
        "Java",
        "Scala"
    ],
    
    
    "Operating Systems": [
        "All OS with Java VM",
        "Linux",
        "Windows"
    ],
    
    
    "Project Type": [
        "Commercial"
    ],
    
    
    "Developer": "{Neo Technology, Inc.}",
    
    
    "Start Date": "{2007}",
    "Start Date Citations": [
        "{https://en.wikipedia.org/wiki/Neo4j}",
        "{https://twitter.com/peterneubauer/status/9248821667}"
    ],
    
    
    "End Date": "{N/A}",
    "End Date Citations": [
        "{https://en.wikipedia.org/wiki/Neo4j}"
    ],
    
    
    "Derived From": "{None}",
    
    
    "License": [
        "AGPL v3",
        "GPL v3"
    ]
}